In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
!pip install sqlalchemy
import pymysql
from sqlalchemy import create_engine

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [3]:
import requests
!pip install BeautifulSoup4
!pip install lxml
from bs4 import BeautifulSoup

Requirement already satisfied: BeautifulSoup4 in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (4.8.2)
Requirement already satisfied: soupsieve>=1.2 in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (from BeautifulSoup4) (1.9.5)
Requirement already satisfied: lxml in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (4.4.2)

In [4]:
import numpy as np

In [5]:
#web scr top10
url = 'https://en.wikipedia.org/wiki/The_World%27s_Billionaires'
html = requests.get(url).content
soup = BeautifulSoup(html, "lxml")

In [6]:
full_df = pd.read_csv('~/Desktop/projectonefolder/Ironhack-Module-1-Project-hatching/data/forbes_2018.csv')

In [7]:
engine = create_engine('sqlite:////Users/Stefania/downloads/stefaniabraca.db')

In [8]:
query = "select * from personal_info"
dfpersonal_info = pd.read_sql_query(query, engine)
query = "select * from business_info"
dfbusiness_info = pd.read_sql_query(query, engine)
query = "select * from rank_info"
dfrank_info = pd.read_sql_query(query, engine)

# Merge Tables To Build DF

In [9]:
def get_main_data(df1, df2, df3):
    merged_df = df1.merge(df2, on='id')
    final_df = merged_df.merge(df3, on='id')
    return final_df

In [10]:
#variable
final_df = get_main_data(dfrank_info, dfbusiness_info, dfpersonal_info)
final_df

,id,name,position,Unnamed: 0_x,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,lastName,age,Unnamed: 0,gender,country,image
0,5227,jeff BEZos,1.0,52,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,bill GATES,2.0,53,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,warrEN BUFFEtt,3.0,54,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,bernarD ARNAULT,4.0,55,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,mark zUCKERBerg,5.0,56,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,zHAO XIAOQIANG,2204.0,2255,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134,zhAO,51 years old,2255,None,China,https://specials-images.forbesimg.com/imageser...
2204,1310,zhOU LIANGZHang,2205.0,2256,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134,zhOU,55 years old,2256,M,China,https://specials-images.forbesimg.com/imageser...
2205,4488,zhu XINGMING,2206.0,2257,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856,zHU,51 years old,2257,M,None,https://specials-images.forbesimg.com/imageser...
2206,7152,ZHUO JUn,2207.0,2258,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978,zhUO,52 years old,2258,Female,Hong Kong,https://specials-images.forbesimg.com/imageser...
2207,7214,OLGUN ZORlu,2208.0,2259,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978,zORLU,54 years old,2259,None,Turkey,https://specials-images.forbesimg.com/imageser...

# Drop Columns

In [11]:
def drop(df, list_col_todrop):
    # drop
    df.drop(list_col_todrop, axis=1, inplace=True)
    
    #cols = list(final_df.columns.values)
    #cols = ['id', 'name', 'lastName', 'position', 'worth', 'Source', 'age', 'gender', 'country', 'image']
    #final_df = final_df.reindex(columns=cols)
    return df

In [12]:
#variable
col_todrop = ['worthChange', 'Unnamed: 0_x', 'Unnamed: 0_y', 'realTimeWorth', 'realTimePosition', 'Unnamed: 0', 'image']
#function "drop"
final_df = drop(final_df, col_todrop)

In [13]:
final_df

,id,name,position,Source,worth,lastName,age,gender,country
0,5227,jeff BEZos,1.0,Technology ==> Amazon,112.0 BUSD,bEZOS,54 years old,None,United States
1,2642,bill GATES,2.0,Technology ==> Microsoft,90.0 BUSD,GATES,62 years old,M,None
2,5422,warrEN BUFFEtt,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,bufFETT,87 years old,M,None
3,8183,bernarD ARNAULT,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,aRNAULt,69 years old,M,France
4,5642,mark zUCKERBerg,5.0,Technology ==> Facebook,71.0 BUSD,zuckeRBERG,1985,M,USA
...,...,...,...,...,...,...,...,...,...
2203,7670,zHAO XIAOQIANG,2204.0,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,zhAO,51 years old,None,China
2204,1310,zhOU LIANGZHang,2205.0,Manufacturing ==> electrical equipment,1.0 BUSD,zhOU,55 years old,M,China
2205,4488,zhu XINGMING,2206.0,Manufacturing ==> electrical equipment,1.0 BUSD,zHU,51 years old,M,None
2206,7152,ZHUO JUn,2207.0,Manufacturing ==> printed circuit boards,1.0 BUSD,zhUO,52 years old,Female,Hong Kong
2207,7214,OLGUN ZORlu,2208.0,Diversified ==> diversified,1.0 BUSD,zORLU,54 years old,None,Turkey

## Separate 'name' Column

In [14]:
def new_name (df):
    col=df["name"].str.split(" ", n = 1, expand = True) 
    df["First Name"]= col[0]
    df["Last Name"]= col[1] 
    return df

In [15]:
new_name(final_df)

,id,name,position,Source,worth,lastName,age,gender,country,First Name,Last Name
0,5227,jeff BEZos,1.0,Technology ==> Amazon,112.0 BUSD,bEZOS,54 years old,None,United States,jeff,BEZos
1,2642,bill GATES,2.0,Technology ==> Microsoft,90.0 BUSD,GATES,62 years old,M,None,bill,GATES
2,5422,warrEN BUFFEtt,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,bufFETT,87 years old,M,None,warrEN,BUFFEtt
3,8183,bernarD ARNAULT,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,aRNAULt,69 years old,M,France,bernarD,ARNAULT
4,5642,mark zUCKERBerg,5.0,Technology ==> Facebook,71.0 BUSD,zuckeRBERG,1985,M,USA,mark,zUCKERBerg
...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,zHAO XIAOQIANG,2204.0,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,zhAO,51 years old,None,China,zHAO,XIAOQIANG
2204,1310,zhOU LIANGZHang,2205.0,Manufacturing ==> electrical equipment,1.0 BUSD,zhOU,55 years old,M,China,zhOU,LIANGZHang
2205,4488,zhu XINGMING,2206.0,Manufacturing ==> electrical equipment,1.0 BUSD,zHU,51 years old,M,None,zhu,XINGMING
2206,7152,ZHUO JUn,2207.0,Manufacturing ==> printed circuit boards,1.0 BUSD,zhUO,52 years old,Female,Hong Kong,ZHUO,JUn
2207,7214,OLGUN ZORlu,2208.0,Diversified ==> diversified,1.0 BUSD,zORLU,54 years old,None,Turkey,OLGUN,ZORlu

In [16]:
def format_data(df): 

    for i in range(df.shape[0]): 
        df.iat[i, 1]= df.iat[i, 1].strip().capitalize() 
        df.iat[i, 5]= df.iat[i, 5].strip().capitalize()
        df.iat[i, 9]= df.iat[i, 9].strip().capitalize() 
  

format_data(final_df) 
final_df.head()

,id,name,position,Source,worth,lastName,age,gender,country,First Name,Last Name
0,5227,Jeff bezos,1.0,Technology ==> Amazon,112.0 BUSD,Bezos,54 years old,None,United States,Jeff,BEZos
1,2642,Bill gates,2.0,Technology ==> Microsoft,90.0 BUSD,Gates,62 years old,M,None,Bill,GATES
2,5422,Warren buffett,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,Buffett,87 years old,M,None,Warren,BUFFEtt
3,8183,Bernard arnault,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,Arnault,69 years old,M,France,Bernard,ARNAULT
4,5642,Mark zuckerberg,5.0,Technology ==> Facebook,71.0 BUSD,Zuckerberg,1985,M,USA,Mark,zUCKERBerg

# Drop Columns

In [17]:
name_drop = ['name', 'Last Name', 'id' ]

In [18]:
final_df = drop(final_df, name_drop)

In [19]:
final_df.head()

,position,Source,worth,lastName,age,gender,country,First Name
0,1.0,Technology ==> Amazon,112.0 BUSD,Bezos,54 years old,None,United States,Jeff
1,2.0,Technology ==> Microsoft,90.0 BUSD,Gates,62 years old,M,None,Bill
2,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,Buffett,87 years old,M,None,Warren
3,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,Arnault,69 years old,M,France,Bernard
4,5.0,Technology ==> Facebook,71.0 BUSD,Zuckerberg,1985,M,USA,Mark

# Re-indexing Columns

In [20]:
reindex_col = ['position', 'worth', 'First Name', 'lastName', 'age', 'gender', 'Source', 'country']

In [21]:
def reindex (df, list):
    df = df.reindex(columns=list)
    newlist = [w.title() for w in list]
    df.columns = newlist
    return df

# (Javi's Pipeline)

In [22]:
#def loquesea (x):    
#    e = reindex(x)
#    y = hola(e)

In [23]:
final_df = reindex(final_df, reindex_col)

# Gender

In [24]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', None, 'Female'], dtype=object)

In [25]:
null_cols = final_df.isnull().sum()
null_cols
null_cols[null_cols > 0]

Age       65
Gender    13
dtype: int64

In [26]:
null_displ = final_df[(final_df['Gender'].isnull()==True)]

In [27]:
null_displ

,Position,Worth,First Name,Lastname,Age,Gender,Source,Country
26,27.0,29.8 BUSD,Beate,Albrecht jr.,66 years old,None,Fashion & Retail ==> supermarkets,Germany
163,164.0,9.3 BUSD,Gianluigi,Aponte,77 years old,None,Logistics ==> Shipping,None
224,225.0,7.1 BUSD,Willi,Liebherr,None,None,Construction & Engineering ==> Construction,None
309,310.0,5.8 BUSD,Tom,Love,81 years old,None,Fashion & Retail ==> retail & gas stations,USA
426,427.0,4.8 BUSD,Philip,Green,66 years old,None,Fashion & Retail ==> fashion retail,None
529,530.0,4.1 BUSD,Jack,Dangermond,72 years old,None,Technology ==> mapping software,None
581,582.0,3.9 BUSD,Stewart,Resnick,None,None,"Food and Beverage ==> agriculture, water",None
596,597.0,3.8 BUSD,Dominika,Kulczyk,None,None,Finance and Investments ==> diversified,None
731,732.0,3.2 BUSD,Andrew,Cherng,None,None,Food and Beverage ==> restaurants,None
766,767.0,3.1 BUSD,Do,Chang,62 years old,None,Fashion & Retail ==> fashion retail,None
1197,1198.0,2.1 BUSD,Ong,Ong beng seng,73 years old,None,Diversified ==> diversified,None
1260,1261.0,2.0 BUSD,Chuchat,Petaumpai,65 years old,None,Finance and Investments ==> motorcycle loans,None
1290,1291.0,1.9 BUSD,Jean-paul,Clozel,None,None,Healthcare ==> pharmaceuticals,Switzerland

In [28]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', None, 'Female'], dtype=object)

In [29]:
final_df.isnull().sum(axis = 0)

Position       0
Worth          0
First Name     0
Lastname       0
Age           65
Gender        13
Source         0
Country        0
dtype: int64

In [30]:
#13 gender Nulls (NaN) index 26 and 596 are female

In [31]:
#final_df.loc[26, 'Gender']='Female'
#display(final_df.loc[26, 'Gender'])

In [32]:
#final_df.loc[596, 'Gender']='Female'
#display(final_df.loc[596, 'Gender'])

In [33]:
#11 (rest) Gender NaN are Male

In [34]:
#final_df["Gender"].fillna("Male", inplace = True)

In [35]:
def gender (df):
    df.loc[26, 'Gender']='Female'
    df.loc[596, 'Gender']='Female'
    df["Gender"].fillna("Male", inplace = True) 
    df.astype({'Gender': str}).dtypes
    return df

In [36]:
gender(final_df)

,Position,Worth,First Name,Lastname,Age,Gender,Source,Country
0,1.0,112.0 BUSD,Jeff,Bezos,54 years old,None,Technology ==> Amazon,United States
1,2.0,90.0 BUSD,Bill,Gates,62 years old,M,Technology ==> Microsoft,None
2,3.0,84.0 BUSD,Warren,Buffett,87 years old,M,Finance and Investments ==> Berkshire Hathaway,None
3,4.0,72.0 BUSD,Bernard,Arnault,69 years old,M,Fashion & Retail ==> LVMH,France
4,5.0,71.0 BUSD,Mark,Zuckerberg,1985,M,Technology ==> Facebook,USA
...,...,...,...,...,...,...,...,...
2203,2204.0,1.0 BUSD,Zhao,Zhao,51 years old,None,"Fashion & Retail ==> fashion, entertainment",China
2204,2205.0,1.0 BUSD,Zhou,Zhou,55 years old,M,Manufacturing ==> electrical equipment,China
2205,2206.0,1.0 BUSD,Zhu,Zhu,51 years old,M,Manufacturing ==> electrical equipment,None
2206,2207.0,1.0 BUSD,Zhuo,Zhuo,52 years old,Female,Manufacturing ==> printed circuit boards,Hong Kong
2207,2208.0,1.0 BUSD,Olgun,Zorlu,54 years old,None,Diversified ==> diversified,Turkey

In [37]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', 'Female'], dtype=object)

In [38]:
def gender_cat (df):
    df.loc[df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'
    df.loc[df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'
    df[['Gender_cat']] = df[['Gender_cat']].fillna('Not Available')
    df.drop('Gender', axis=1, inplace=True)
    
    return df

In [39]:
#Gender Value=M to Male
#final_df.loc[final_df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'

In [40]:
#Gender Value=F to Female
#final_df.loc[final_df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'

In [41]:
#Gender Value nan
#null_displ = final_df[(final_df['Gender_cat'].isnull()==True)]

In [42]:
#Gender Value nana to Not Available
#final_df[['Gender_cat']] = final_df[['Gender_cat']].fillna('Not Available')

In [43]:
gender_cat(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1.0,112.0 BUSD,Jeff,Bezos,54 years old,Technology ==> Amazon,United States,Not Available
1,2.0,90.0 BUSD,Bill,Gates,62 years old,Technology ==> Microsoft,None,Male
2,3.0,84.0 BUSD,Warren,Buffett,87 years old,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4.0,72.0 BUSD,Bernard,Arnault,69 years old,Fashion & Retail ==> LVMH,France,Male
4,5.0,71.0 BUSD,Mark,Zuckerberg,1985,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204.0,1.0 BUSD,Zhao,Zhao,51 years old,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205.0,1.0 BUSD,Zhou,Zhou,55 years old,Manufacturing ==> electrical equipment,China,Male
2205,2206.0,1.0 BUSD,Zhu,Zhu,51 years old,Manufacturing ==> electrical equipment,None,Male
2206,2207.0,1.0 BUSD,Zhuo,Zhuo,52 years old,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208.0,1.0 BUSD,Olgun,Zorlu,54 years old,Diversified ==> diversified,Turkey,Not Available

# POSITION to INT

In [44]:
final_df.Position = final_df.Position.astype(int)

In [45]:
final_df

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54 years old,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62 years old,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87 years old,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69 years old,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,1985,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51 years old,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55 years old,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51 years old,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52 years old,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54 years old,Diversified ==> diversified,Turkey,Not Available

In [46]:
final_df.dtypes

Position       int64
Worth         object
First Name    object
Lastname      object
Age           object
Source        object
Country       object
Gender_cat    object
dtype: object

# Age Column

In [47]:
final_df.Age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old',
       None, '72 years old', '48 years old', '77 years old',
       '86 years old', '57 years old', '1988', '55 years old',
       '94 years old', '47 years old', '71 years old', '92 years old',
       '88 years old', '85 years old', '49 years old', '51 years old',
       '50 years old', '43 years old', '42 years old', '91 years old',
       '58 years old', '1984', '38 years old', '1982', '95 years old',
       '39 years old', '41 years old', '40 years old', '1990', '1991',
       '97 years old', '1986', '99 years old', '1994', '1998', '1996',
       '96 years old', '1987', '1989', '1992'], dtype=object)

In [48]:
def clean_age (df):
    df = df['Age'].str.replace('years old', '')
    df[['Age']] = df[['Age']].fillna(0)

In [49]:
#final_df.Age.unique()

In [50]:
#1
final_df['Age'] = final_df['Age'].str.replace('years old', '')
#nans are back

In [51]:
#2
final_df[['Age']] = final_df[['Age']].fillna(0)

In [52]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '1985', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '1983', '65 ', '83 ', '67 ', '75 ', '89 ', 0,
       '72 ', '48 ', '77 ', '86 ', '57 ', '1988', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '1984', '38 ', '1982', '95 ', '39 ', '41 ', '40 ',
       '1990', '1991', '97 ', '1986', '99 ', '1994', '1998', '1996',
       '96 ', '1987', '1989', '1992'], dtype=object)

In [53]:
#def year_toage (series):
 #   if len(x) > 3 lambda x: 2018-x

In [54]:
def year_toage (df):
    df['Age'] = df['Age'].str.replace('1982', '36')
    df['Age'] = df['Age'].str.replace('1983', '35')
    df['Age'] = df['Age'].str.replace('1984', '34')
    df['Age'] = df['Age'].str.replace('1985', '33')
    df['Age'] = df['Age'].str.replace('1986', '32')
    df['Age'] = df['Age'].str.replace('1987', '31')
    df['Age'] = df['Age'].str.replace('1988', '30')
    df['Age'] = df['Age'].str.replace('1989', '29')
    df['Age'] = df['Age'].str.replace('1990', '28')
    df['Age'] = df['Age'].str.replace('1991', '27')
    df['Age'] = df['Age'].str.replace('1992', '26')
    df['Age'] = df['Age'].str.replace('1994', '24')
    df['Age'] = df['Age'].str.replace('1996', '22')
    df['Age'] = df['Age'].str.replace('1998', '20')
    return df

In [55]:
year_toage (final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

In [56]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', nan,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '29',
       '26'], dtype=object)

In [57]:
def nan_toage (df):
    df[['Age']] = df[['Age']].fillna(0)
    df.Age = df.Age.astype(int)
    mean= df['Age'].mean()
    df.replace({'Age': {0: 'mean'}})
    return df

In [58]:
nan_toage(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

In [59]:
final_df.Age.unique()

array([54, 62, 87, 69, 33, 82, 78, 73, 76, 45, 44, 70, 68, 46, 64, 61, 53,
       84, 90, 59, 63, 66, 80, 81, 56, 79, 74, 60, 93, 52, 35, 65, 83, 67,
       75, 89,  0, 72, 48, 77, 86, 57, 30, 55, 94, 47, 71, 92, 88, 85, 49,
       51, 50, 43, 42, 91, 58, 34, 38, 36, 95, 39, 41, 40, 28, 27, 97, 32,
       99, 24, 20, 22, 96, 31, 29, 26])

# COUNTRY Column

In [60]:
final_df.Country.unique()

array(['United States', 'None', 'France', 'USA', 'Mexico',
       "People's Republic of China", 'Hong Kong', 'Germany', 'Canada',
       'China', 'Russia', 'South Korea', 'Ireland', 'Indonesia',
       'Australia', 'Czech Republic', 'India', 'Brazil', 'Italy',
       'New Zealand', 'Israel', 'Switzerland', 'Austria', 'Sweden',
       'Cyprus', 'Spain', 'Norway', 'United Kingdom',
       'United Arab Emirates', 'Philippines', 'Denmark', 'Netherlands',
       'Portugal', 'Japan', 'Swaziland', 'Vietnam', 'Thailand', 'Oman',
       'UK', 'Colombia', 'Malaysia', 'Kazakhstan', 'Poland', 'Singapore',
       'Greece', 'Chile', 'Taiwan', 'Turkey', 'South Africa', 'Angola',
       'Guernsey', 'Finland', 'Iceland', 'Egypt', 'Monaco', 'Peru',
       'Argentina', 'Qatar', 'Lebanon', 'St. Kitts and Nevis', 'Nigeria',
       'Tanzania', 'Ukraine', 'Slovakia', 'Venezuela'], dtype=object)

In [61]:
final_df.Country = final_df.Country.astype(str)

In [62]:
final_df['Country'].value_counts()

None             1386
United States     200
China             116
USA                67
Germany            45
                 ...
Guernsey            1
Tanzania            1
Slovakia            1
Colombia            1
Swaziland           1
Name: Country, Length: 65, dtype: int64

In [63]:
def clean_country (df):
    df['Country'] = df['Country'].str.replace('USA', 'United States')
    df['Country'] = df['Country'].str.replace("People's Republic of China", 'China')
    return df

In [64]:
clean_country(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

# WEB SCRP TOP10

In [65]:
def scr_top10 (url, html, soup):
    table = soup.find_all('table',{'class':'wikitable sortable'})[0]
    return table

In [66]:
table = scr_top10(url, html, soup)

In [67]:
def scr_table (table):
    rows = table.find_all('tr')
    rows_parsed = [row.text for row in rows]
    rows = [row.text.strip().split("\n") for row in rows]
    colnames = rows[0]
    for ele in colnames: 
        if ele == (''): 
            colnames.remove(ele) 
    data = rows[1:]
    top10_df = pd.DataFrame(data, columns=colnames)
    top10_df.drop(columns=['Name', 'Net worth (USD)','Age', 'Source(s) of wealth'], inplace=True)
    top10_df.rename(columns={"No.": "Position"}, inplace=True)
    
  
    return top10_df

In [68]:
top10_df = scr_table(table)
top10_df

  Position     Nationality
0       1    United States
1       2    United States
2       3    United States
3       4           France
4       5           Mexico
5       6            Spain
6       7    United States
7       8    United States
8       9    United States
9      10    United States

In [69]:
top10_df = top10_df.astype({"Position": int})

In [70]:
def merge1 (df1,df2):
    merged_df = pd.merge(df1, df2, on='Position', how='outer')
    merged_df['Country'] = np.where(merged_df['Country'] == 'None', merged_df['Nationality'], merged_df['Country'])
    merged_df[['Country']] = merged_df[['Country']].fillna('None')
    return merged_df

In [71]:
merged_df = merge1(final_df, top10_df)

In [72]:
merged_df

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available,United States
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,United States,Male,United States
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,United States,Male,United States
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male,France
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male,Mexico
...,...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available,NaN
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male,NaN
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male,NaN
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female,NaN
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available,NaN

In [73]:
merged_df.tail()

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available,NaN
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male,NaN
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male,NaN
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female,NaN
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available,NaN

In [74]:
top10_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
Position       10 non-null int64
Nationality    10 non-null object
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

# FULL_DF

In [75]:
full_df

,position,name,lastName,age,country,gender,wealthSource,industry,worth,worthChange,realTimeWorth,realTimePosition,image
0,NaN,Anant Asavabhokhin & family,Asavabhokhin,67.0,Thailand,M,real estate,Real Estate,NaN,-0.001,NaN,1613,https://specials-images.forbesimg.com/imageser...
1,NaN,Arash Ferdowsi,Ferdowsi,32.0,United States,M,online file storage,Technology,NaN,0.000,NaN,1734,https://specials-images.forbesimg.com/imageser...
2,NaN,Banthoon Lamsam & family,Lamsam,65.0,Thailand,M,banking,Finance and Investments,NaN,0.001,NaN,1952,https://specials-images.forbesimg.com/imageser...
3,NaN,Bill Adderley & family,Adderley,70.0,United Kingdom,M,home furnishings,Fashion & Retail,NaN,0.000,NaN,1956,https://specials-images.forbesimg.com/imageser...
4,NaN,Boris Zingarevich,Zingarevich,58.0,Russia,M,"pulp and paper, diversified",Diversified,NaN,0.000,NaN,2103,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2255,2204.0,Zhao Xiaoqiang,Zhao,51.0,China,M,"fashion, entertainment",Fashion & Retail,1000.0,0.000,NaN,2134,https://specials-images.forbesimg.com/imageser...
2256,2205.0,Zhou Liangzhang,Zhou,55.0,China,M,electrical equipment,Manufacturing,1000.0,NaN,NaN,2134,https://specials-images.forbesimg.com/imageser...
2257,2206.0,Zhu Xingming,Zhu,51.0,China,M,electrical equipment,Manufacturing,1000.0,0.000,NaN,1856,https://specials-images.forbesimg.com/imageser...
2258,2207.0,Zhuo Jun,Zhuo,52.0,Hong Kong,F,printed circuit boards,Manufacturing,1000.0,0.000,NaN,1978,https://specials-images.forbesimg.com/imageser...
2259,2208.0,Olgun Zorlu,Zorlu,54.0,Turkey,M,diversified,Diversified,1000.0,NaN,NaN,1978,https://specials-images.forbesimg.com/imageser...

# MERGE 2

In [76]:
def clean_fulldf (full_df):
    full_df.sort_values(by=['position'])
    null_displ = full_df[(full_df['position'].isnull()==True)]
    full_df.dropna(subset=['position'], inplace=True)
    full_df.position.astype(int)
    full_df.drop(columns=['lastName', 'age', 'gender', 'wealthSource', 'industry', 'worthChange', 'realTimeWorth', 'realTimePosition'], inplace=True) 
    full_df.drop(columns=['worth', 'image'], inplace=True) 
    full_df.rename(columns={"position": "Position"}, inplace=True)
    return full_df

In [77]:
full_df = clean_fulldf(full_df)

In [78]:
full_df

      Position             name        country
52         1.0       Jeff Bezos  United States
53         2.0       Bill Gates  United States
54         3.0   Warren Buffett  United States
55         4.0  Bernard Arnault         France
56         5.0  Mark Zuckerberg  United States
...        ...              ...            ...
2255    2204.0   Zhao Xiaoqiang          China
2256    2205.0  Zhou Liangzhang          China
2257    2206.0     Zhu Xingming          China
2258    2207.0         Zhuo Jun      Hong Kong
2259    2208.0      Olgun Zorlu         Turkey

[2208 rows x 3 columns]

In [79]:
merged_df.head(15)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available,United States
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,United States,Male,United States
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,United States,Male,United States
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male,France
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male,Mexico
5,6,70.0 BUSD,Amancio,Ortega,82,Fashion & Retail ==> Zara,Spain,Male,Spain
6,7,67.1 BUSD,Carlos,Slim helu,78,Telecom ==> telecom,Mexico,Not Available,United States
7,8,60.0 BUSD,Charles,Koch,82,Diversified ==> Koch Industries,United States,Male,United States
8,9,60.0 BUSD,David,Koch,78,Diversified ==> Koch Industries,United States,Male,United States
9,10,58.5 BUSD,Larry,Ellison,73,Technology ==> software,United States,Male,United States
10,11,50.0 BUSD,Michael,Bloomberg,76,Media & Entertainment ==> Bloomberg LP,None,Male,NaN
11,12,48.8 BUSD,Larry,Page,45,Technology ==> Google,None,Not Available,NaN
12,13,47.5 BUSD,Sergey,Brin,44,Technology ==> Google,United States,Male,NaN
13,14,46.4 BUSD,Jim,Walton,70,Fashion & Retail ==> Walmart,United States,Male,NaN
14,15,46.2 BUSD,S.,Walton,73,Fashion & Retail ==> Walmart,None,Male,NaN

In [80]:
def merge2 (df1,df2):
    merged2_df = pd.merge(df1, df2, on='Position', how='outer')
    return merged2_df

In [81]:
merged2_df = merge2(merged_df, full_df)

In [82]:
merged2_df.head(15)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality,name,country
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available,United States,Jeff Bezos,United States
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,United States,Male,United States,Bill Gates,United States
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,United States,Male,United States,Warren Buffett,United States
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male,France,Bernard Arnault,France
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male,Mexico,Mark Zuckerberg,United States
5,6,70.0 BUSD,Amancio,Ortega,82,Fashion & Retail ==> Zara,Spain,Male,Spain,Amancio Ortega,Spain
6,7,67.1 BUSD,Carlos,Slim helu,78,Telecom ==> telecom,Mexico,Not Available,United States,Carlos Slim Helu,Mexico
7,8,60.0 BUSD,Charles,Koch,82,Diversified ==> Koch Industries,United States,Male,United States,Charles Koch,United States
8,9,60.0 BUSD,David,Koch,78,Diversified ==> Koch Industries,United States,Male,United States,David Koch,United States
9,10,58.5 BUSD,Larry,Ellison,73,Technology ==> software,United States,Male,United States,Larry Ellison,United States
10,11,50.0 BUSD,Michael,Bloomberg,76,Media & Entertainment ==> Bloomberg LP,None,Male,NaN,Michael Bloomberg,United States
11,12,48.8 BUSD,Larry,Page,45,Technology ==> Google,None,Not Available,NaN,Larry Page,United States
12,13,47.5 BUSD,Sergey,Brin,44,Technology ==> Google,United States,Male,NaN,Sergey Brin,United States
13,14,46.4 BUSD,Jim,Walton,70,Fashion & Retail ==> Walmart,United States,Male,NaN,Jim Walton,United States
14,15,46.2 BUSD,S.,Walton,73,Fashion & Retail ==> Walmart,None,Male,NaN,S. Robson Walton,United States

In [83]:
def fillall (merged2_df):
    merged2_df['Country'] = np.where(merged2_df['Country'] == 'None', merged2_df['country'], merged2_df['Country'])
    return merged2_df

In [84]:
merged2_df = fillall(merged2_df)
merged2_df

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality,name,country
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available,United States,Jeff Bezos,United States
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,United States,Male,United States,Bill Gates,United States
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,United States,Male,United States,Warren Buffett,United States
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male,France,Bernard Arnault,France
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male,Mexico,Mark Zuckerberg,United States
...,...,...,...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available,NaN,Zhao Xiaoqiang,China
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male,NaN,Zhou Liangzhang,China
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,China,Male,NaN,Zhu Xingming,China
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female,NaN,Zhuo Jun,Hong Kong
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available,NaN,Olgun Zorlu,Turkey

In [85]:
merged2_df.Country.unique()

array(['United States', '\xa0United States', 'France', '\xa0Spain',
       'Mexico', 'China', 'India', 'Hong Kong', 'Germany', 'Brazil',
       'Canada', 'Italy', 'Austria', 'Japan', 'Philippines',
       'United Kingdom', 'Russia', 'South Korea', 'Thailand', 'Ireland',
       'Indonesia', 'Australia', 'Sweden', 'Chile', 'Netherlands',
       'Czech Republic', 'Malaysia', 'Nigeria', 'Colombia', 'Singapore',
       'New Zealand', 'Israel', 'Switzerland', 'Taiwan', 'South Africa',
       'Denmark', 'Cyprus', 'Spain', 'Norway', 'Egypt', 'Belgium',
       'United Arab Emirates', 'Ukraine', 'Portugal', 'Turkey', 'Georgia',
       'Venezuela', 'Swaziland', 'Vietnam', 'Finland', 'Algeria', 'Oman',
       'UK', 'Liechtenstein', 'Poland', 'Peru', 'Kazakhstan', 'Greece',
       'Argentina', 'Lebanon', 'Angola', 'Guernsey', 'Morocco', 'Monaco',
       'Iceland', 'Qatar', 'St. Kitts and Nevis', 'Nepal', 'Tanzania',
       'Kuwait', 'Macau', 'Zimbabwe', 'Slovakia', 'Romania', 'Hungary'],
      dtype=object)

In [86]:
def cleancountry (merged2_df):
    merged2_df['Country'] = merged2_df['Country'].str.replace('\xa0United States', 'United States')
    merged2_df['Country'] = merged2_df['Country'].str.replace("People's Republic of China", 'China')
    merged2_df['Country'] = merged2_df['Country'].str.replace('\xa0Spain', 'Spain')
    merged2_df["Country"]= merged2_df["Country"].astype(str) 
    merged2_df.drop(columns=['Nationality', 'name','country'], inplace=True) 
    return merged2_df

In [87]:
merged2_df = cleancountry(merged2_df)

In [88]:
merged2_df.Country.unique()

array(['United States', 'France', 'Spain', 'Mexico', 'China', 'India',
       'Hong Kong', 'Germany', 'Brazil', 'Canada', 'Italy', 'Austria',
       'Japan', 'Philippines', 'United Kingdom', 'Russia', 'South Korea',
       'Thailand', 'Ireland', 'Indonesia', 'Australia', 'Sweden', 'Chile',
       'Netherlands', 'Czech Republic', 'Malaysia', 'Nigeria', 'Colombia',
       'Singapore', 'New Zealand', 'Israel', 'Switzerland', 'Taiwan',
       'South Africa', 'Denmark', 'Cyprus', 'Norway', 'Egypt', 'Belgium',
       'United Arab Emirates', 'Ukraine', 'Portugal', 'Turkey', 'Georgia',
       'Venezuela', 'Swaziland', 'Vietnam', 'Finland', 'Algeria', 'Oman',
       'UK', 'Liechtenstein', 'Poland', 'Peru', 'Kazakhstan', 'Greece',
       'Argentina', 'Lebanon', 'Angola', 'Guernsey', 'Morocco', 'Monaco',
       'Iceland', 'Qatar', 'St. Kitts and Nevis', 'Nepal', 'Tanzania',
       'Kuwait', 'Macau', 'Zimbabwe', 'Slovakia', 'Romania', 'Hungary'],
      dtype=object)

In [89]:
merged2_df.columns

Index(['Position', 'Worth', 'First Name', 'Lastname', 'Age', 'Source',
       'Country', 'Gender_cat'],
      dtype='object')

In [90]:
merged2_df

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,United States,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,United States,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,China,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

In [91]:
merged2_df.describe()

          Position          Age
count  2208.000000  2208.000000
mean   1104.500000    61.914402
std     637.539018    16.860213
min       1.000000     0.000000
25%     552.750000    53.000000
50%    1104.500000    63.000000
75%    1656.250000    73.000000
max    2208.000000    99.000000

# WEB Scrapping EDUCATION

In [92]:
tertiary_ed = pd.read_csv('~/Desktop/projectonefolder/Ironhack-Module-1-Project-hatching/data/merged_ter.csv')

In [93]:
tertiary_ed

,Position,First Name,Last Name,Age,Worth,Gender_cat,Source,Country,Image,Age25–64(%)
0,1.0,Jeff,Bezos,54.0,112.0 BUSD,Not Available,Technology ==> Amazon,United States,https://specials-images.forbesimg.com/imageser...,44.0
1,2.0,Bill,Gates,62.0,90.0 BUSD,Male,Technology ==> Microsoft,United States,https://specials-images.forbesimg.com/imageser...,44.0
2,3.0,Warren,Buffett,87.0,84.0 BUSD,Male,Finance and Investments ==> Berkshire Hathaway,United States,https://specials-images.forbesimg.com/imageser...,44.0
3,8.0,Charles,Koch,82.0,60.0 BUSD,Male,Diversified ==> Koch Industries,United States,https://specials-images.forbesimg.com/imageser...,44.0
4,10.0,Larry,Ellison,73.0,58.5 BUSD,Male,Technology ==> software,United States,https://specials-images.forbesimg.com/imageser...,44.0
...,...,...,...,...,...,...,...,...,...,...
2210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Latvia,NaN,30.0
2211,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Lithuania,NaN,37.0
2212,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Luxembourg,NaN,46.0
2213,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Saudi Arabia,NaN,22.0
2214,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Slovenia,NaN,29.0

In [94]:
tertiary_ed.tail(15)

,Position,First Name,Last Name,Age,Worth,Gender_cat,Source,Country,Image,Age25–64(%)
2200,1654.0,Kutayba,Alghanim,72.0,1.4 BUSD,Not Available,Diversified ==> diversified,Kuwait,https://specials-images.forbesimg.com/imageser...,NaN
2201,1868.0,Fawzi,Al-kharafi,0.0,1.2 BUSD,Male,Diversified ==> diversified,Kuwait,https://specials-images.forbesimg.com/imageser...,NaN
2202,1869.0,Mohannad,Al-kharafi,0.0,1.2 BUSD,Male,Diversified ==> diversified,Kuwait,https://specials-images.forbesimg.com/imageser...,NaN
2203,1690.0,Hoi,Hoi,65.0,1.4 BUSD,Male,Real Estate ==> real estate,Macau,https://specials-images.forbesimg.com/imageser...,NaN
2204,1710.0,Strive,Masiyiwa,57.0,1.4 BUSD,Not Available,Telecom ==> telecom,Zimbabwe,https://specials-images.forbesimg.com/imageser...,NaN
2205,1766.0,Ivan,Chrenko,50.0,1.3 BUSD,Male,Real Estate ==> real estate,Slovakia,https://specials-images.forbesimg.com/imageser...,20.0
2206,1973.0,Ion,Tiriac,79.0,1.2 BUSD,Male,"Finance and Investments ==> banking, insurance",Romania,https://specials-images.forbesimg.com/imageser...,NaN
2207,2024.0,Sandor,Csanyi,65.0,1.1 BUSD,Male,"Diversified ==> finance, real estate",Hungary,https://specials-images.forbesimg.com/imageser...,23.0
2208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Costa Rica,NaN,18.0
2209,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Estonia,NaN,38.0
2210,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Latvia,NaN,30.0
2211,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Lithuania,NaN,37.0
2212,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Luxembourg,NaN,46.0
2213,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Saudi Arabia,NaN,22.0
2214,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Slovenia,NaN,29.0

In [95]:
tertiary_ed.drop(tertiary_ed.index[[2208, 2209, 2210, 2211, 2212, 2213, 2214]], inplace=True)

In [96]:
tertiary_ed = drop(tertiary_ed, 'Image')

In [97]:
tertiary_ed

,Position,First Name,Last Name,Age,Worth,Gender_cat,Source,Country,Age25–64(%)
0,1.0,Jeff,Bezos,54.0,112.0 BUSD,Not Available,Technology ==> Amazon,United States,44.0
1,2.0,Bill,Gates,62.0,90.0 BUSD,Male,Technology ==> Microsoft,United States,44.0
2,3.0,Warren,Buffett,87.0,84.0 BUSD,Male,Finance and Investments ==> Berkshire Hathaway,United States,44.0
3,8.0,Charles,Koch,82.0,60.0 BUSD,Male,Diversified ==> Koch Industries,United States,44.0
4,10.0,Larry,Ellison,73.0,58.5 BUSD,Male,Technology ==> software,United States,44.0
...,...,...,...,...,...,...,...,...,...
2203,1690.0,Hoi,Hoi,65.0,1.4 BUSD,Male,Real Estate ==> real estate,Macau,NaN
2204,1710.0,Strive,Masiyiwa,57.0,1.4 BUSD,Not Available,Telecom ==> telecom,Zimbabwe,NaN
2205,1766.0,Ivan,Chrenko,50.0,1.3 BUSD,Male,Real Estate ==> real estate,Slovakia,20.0
2206,1973.0,Ion,Tiriac,79.0,1.2 BUSD,Male,"Finance and Investments ==> banking, insurance",Romania,NaN
2207,2024.0,Sandor,Csanyi,65.0,1.1 BUSD,Male,"Diversified ==> finance, real estate",Hungary,23.0